{"https://quizlet.com/408460049/science-stuff-flash-cards/":{"Basalt":"Dark, fine-grained, extrusive igneous rock (makes up the ocean floor)","Breccia":"coarse sedimentary rock consisting of angular fragments that are jagged","Coal":"Sedimentary rock formed from decayed swamp plants","Conglomerate":"A rock consisting of individual rounded stones that have become cemented together.","Erosion":"Wind, water, and ice carrying away sediment","Foliated":"Term used to describe metamorphic rocks whose grains are arranged in parallel layers or bands.","Gniess used to be.............":"Granite","Grains":"fragments that make up a rock","Granite":"A usually light colored (high silica) intrusive igneous rock that is found in the crust.","Halite":"Sedimentary rock that is formed from the evaporation of ancient","Heat and Pressure lead to __________ rocks.":"Metamorphic","How many Rock-forming minerals?":"There are 20 rock-forming minerals","Igneous Rocks":"Form from magma or lava. 2 types, Intrusive and extrusive","Ignis (Latin)":"fire","Limestone":"Sedimentary rock made from fragments of marine life shells","Marble used to be..........":"limestone","Melting and Volcanic activity lead to ________ rocks":"Igneous","Metamorphic Rock":"a rock that is changed by extreme heat and\\/or pressure.","Non-Foilated":"do not have a layered or banded appearance","Porphyritic":"2 step cooling process = 2 grain sizes","Quartzite used to be...........":"sandstone","Rock Cycle":"a series of processes that occur on Earth's surface and in the crust and mantle that slowly change the rocks from one kind to another.","Sandstone":"A clastic sedimentary rock formed by cementing grains of sand over time.","Sedimentary rocks":"formed from sediments getting pushed down by natural forces","Slate used to be.........":"shale","Texture":"the look and\\/or feel of a rock's surface","Weathering and erosion lead to ___________ rocks":"Sedimentary","What 2 forces create Metamorphic rocks?":"heat and pressure","cementation":"The process in which dissolved minerals crystallize and glue particles of sediment together","chemical rock":"forms from evaporation of ancient ocean","clastic rock":"A sedimentary rock composed of weathered fragments of other rock.","compaction":"the process by which sediments are pressed together under their own weight","deposition":"the process in which material is laid down","extrusive rock":"Igneous rock that forms from lava on Earth's surface","high silica":"light color","intrusive rock":"Igneous rock that forms when magma hardens beneath Earth's surface.","low silica":"dark color","organic rock":"sedimentary rock that forms from remains of organisms such as swamp plants and marine shells","sediment":"small, solid pieces of material that come from rocks or living things","shale":"Sedimentary rock that is formed by the smallest forms of rocks.","weathering":"The breaking down of rocks and minerals on the Earth's surface."}}
